src/unit6/arkham/app/views/carts/show.html.erb

<ul>
	<% @cart.line_items.each do |item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]