src/unit6/arkham/app/controllers/asylum_controller.rb

SELECT "villains".* FROM "villains" ORDER BY intel
---
  def index
  	@cart = current_cart
  	@villains = Villain.all