src/unit6/arkham/app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
  	begin
		@cart = Cart.find(params[:id])

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 12 Feb 2014 01:05:36 UTC +00:00], ["updated_at", Wed, 12 Feb 2014 01:05:36 UTC +00:00]]
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190962]]
---
  def destroy
  	@cart = current_cart
    @cart.destroy