src/unit6/arkham/app/controllers/line_items_controller.rb

  def create
  	@cart = current_cart
	villain = Villain.find(params[:villain_id])
	@line_item = @cart.add_villain(villain.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "villains".* FROM "villains" WHERE "villains"."id" = ? ORDER BY name LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 12 Feb 2014 01:10:59 UTC +00:00], ["updated_at", Wed, 12 Feb 2014 01:10:59 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "updated_at", "villain_id") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Wed, 12 Feb 2014 01:08:29 UTC +00:00], ["updated_at", Wed, 12 Feb 2014 01:08:29 UTC +00:00], ["villain_id", 1]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 2  [["quantity", 2], ["updated_at", Wed, 12 Feb 2014 07:46:51 UTC +00:00]]

  def destroy
    @line_item.destroy
---
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]