src/unit6/arkham/app/controllers/villains_controller.rb

  def index
    @villains = Villain.all
---
SELECT "villains".* FROM "villains" ORDER BY intel

  def create
    @villain = Villain.new(villain_params)

    respond_to do |format|
      if @villain.save
---
INSERT INTO "villains" ("combat", "created_at", "durab", "gender", "image_url", "intel", "name", "power", "speed", "str", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @villain.update(villain_params)
---
UPDATE "villains" SET "name" = ?, "gender" = ?, "intel" = ?, "str" = ?, "speed" = ?, "durab" = ?, "power" = ?, "combat" = ?, "image_url" = ?, "updated_at" = ? WHERE "villains"."id" = 980190962

  def destroy
    @villain.destroy
---
DELETE FROM "villains" WHERE "villains"."id" = ?  [["id", 980190962]]

    def set_villain
      @villain = Villain.find(params[:id])
---
SELECT "villains".* FROM "villains" WHERE "villains"."id" = ? ORDER BY intel LIMIT 1  [["id", "980190962"]]